#### №19-21
Условие: Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один или четыре камня либо увеличить количество камней в куче в три раза. У каждого игрока есть неограниченное количество камней, чтобы делать ходы. Игра завершается в тот момент, когда количество камней в куче становится не менее 43. Победителем считается игрок, сделавший последний ход, т.е. первым получивший кучу из 43 камней или больше. В начальный момент в куче было S камней; 1 ≤ S ≤ 42. Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника. Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия: 
-Петя не может выиграть за один ход; 
-Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня. Найденные значения запишите в ответе в порядке возрастания.

```
def f(s, m):
    if s >= 43:
        return m % 2 == 0
        
    if m == 0:
        return 0
        
    h = [f(s + 1, m - 1), f(s + 4, m - 1), f(s * 3, m - 1)]
    return any(h) if (m - 1)  % 2 == 0 else all(h)


print('19', [s for s in range(1, 43) if f(s, 2)])
print('20', [s for s in range(1, 43) if not f(s, 1) and f(s, 3)])
print('21', [s for s in range(1, 43) if not f(s, 2) and f(s, 4)])
```